#include<iostream>
using namespace std;

//Создание структуры
struct Point
{
	//Структура Point описывает точки на плоскости
	double x;
	double y;
};
//Создавая структуру или класс, мы создаем новый тип данных,
//а объявляя объекты этого класса или структуры, мы создаем переменные нашего типа
// Классы и структур еще называют пользовательскими типами данных


//                    КЛАСС - ЭТО ТИП ДАННЫХ
//                СТРУКТУРА - ЭТО ТИП ДАННЫХ
//                   ОБЪЕКТ - ЭТО САМАЯ ОБЫЧНАЯ ПЕРЕМЕННАЯ


void main()
{
	setlocale(LC_ALL, "");
	int a;     // Объявление переменной "а", типа 'int'
	Point A;   // Объявление объекта 'A' типа 'Point' 
}